app/views/books/index.html.erb

	コメント数:
	<%= book.book_comments.count %>
---
SELECT "books".* FROM "books"