app/views/books/show.html.erb

							コメント数:
							<%= @mybook.book_comments.count %>
---
SELECT "books".* FROM "books"