app/controllers/books_controller.rb

  def show
  	@book = Book.new
  	@mybook = Book.find(params[:id])
  	@user = @mybook.user
  	@books = Book.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "books".* FROM "books"

  def create
   @user=current_user
   @book = Book.new(book_params)
   @book.user_id = current_user.id
   if @book.save
      flash[:succees]="Book was successfully created."
      redirect_to book_path(@book)
   else
  	@books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "l"], ["body", "nmm"], ["created_at", "2020-03-14 12:43:35.414479"], ["updated_at", "2020-03-14 12:43:35.414479"], ["user_id", 16]]
SELECT "books".* FROM "books"

  def update
  	@book=Book.find(params[:id])
  	if@book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "tgtg"], ["body", "tgt"], ["updated_at", "2020-03-14 11:36:49.692844"], ["id", 34]]

  def destroy
		book = Book.find(params[:id])
  	    book.user_id == current_user.id
        book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 28]]