app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
	def index
    	@users=User.all
    	@book=Book.new
    	@user=User.find(current_user.id)

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
	def show
        @users=User.all
        @user=User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", nil], ["updated_at", "2020-03-14 12:43:18.869197"], ["id", 1]]
---
    def update
	  @user=User.find(params[:id])
		if
			@user.update(user_params)